# 5. 데이터 확인

In [27]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1     채치수  북산고  197   90   85  100  95  85      Python
2     정대만  북산고  184   40   35   50  55  25        Java
3     송태섭  북산고  168   80   75   70  80  75  Javascript
4     서태웅  북산고  187   40   60   70  75  80         NaN
5     강백호  북산고  188   15   20   10  35  10         NaN
6     변덕규  능남고  202   80  100   95  85  80           C
7     황태산  능남고  188   55   65   45  40  35      PYTHON
8     윤대협  능남고  190  100   85   90  95  95          C#

In [2]:
df.describe() # 계산 가능한 데이터에 대해서
              # colums별로, 데이터의 개수, 평균, 표준편차, 최소/최대값 등의 정보를 보여줌

                키          국어          영어          수학         과학         사회
count    8.000000    8.000000    8.000000    8.000000   8.000000   8.000000
mean   188.000000   62.500000   65.625000   66.250000  70.000000  60.625000
std      9.985704   29.519969   26.917533   30.325614  23.754699  32.120032
min    168.000000   15.000000   20.000000   10.000000  35.000000  10.000000
25%    186.250000   40.000000   53.750000   48.750000  51.250000  32.500000
50%    188.000000   67.500000   70.000000   70.000000  77.500000  77.500000
75%    191.750000   82.500000   85.000000   91.250000  87.500000  81.250000
max    202.000000  100.000000  100.000000  100.000000  95.000000  95.000000

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 1 to 8
Data columns (total 9 columns):
이름      8 non-null object
학교      8 non-null object
키       8 non-null int64
국어      8 non-null int64
영어      8 non-null int64
수학      8 non-null int64
과학      8 non-null int64
사회      8 non-null int64
SW특기    6 non-null object
dtypes: int64(6), object(3)
memory usage: 640.0+ bytes

In [4]:
df.head() # 처음 5개의 row를 가져옴 -> default = 5

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1     채치수  북산고  197  90  85  100  95  85      Python
2     정대만  북산고  184  40  35   50  55  25        Java
3     송태섭  북산고  168  80  75   70  80  75  Javascript
4     서태웅  북산고  187  40  60   70  75  80         NaN
5     강백호  북산고  188  15  20   10  35  10         NaN

In [5]:
df.head(7) # 처음 7개의 row를 가져옴

       이름   학교    키  국어   영어   수학  과학  사회        SW특기
지원번호
1     채치수  북산고  197  90   85  100  95  85      Python
2     정대만  북산고  184  40   35   50  55  25        Java
3     송태섭  북산고  168  80   75   70  80  75  Javascript
4     서태웅  북산고  187  40   60   70  75  80         NaN
5     강백호  북산고  188  15   20   10  35  10         NaN
6     변덕규  능남고  202  80  100   95  85  80           C
7     황태산  능남고  188  55   65   45  40  35      PYTHON

In [6]:
df.tail() # 마지막 5개의 row를 가져옴 -> default = 5

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
4     서태웅  북산고  187   40   60  70  75  80     NaN
5     강백호  북산고  188   15   20  10  35  10     NaN
6     변덕규  능남고  202   80  100  95  85  80       C
7     황태산  능남고  188   55   65  45  40  35  PYTHON
8     윤대협  능남고  190  100   85  90  95  95      C#

In [7]:
df.tail(3) # 마지막 3개의 row를 가져옴

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6     변덕규  능남고  202   80  100  95  85  80       C
7     황태산  능남고  188   55   65  45  40  35  PYTHON
8     윤대협  능남고  190  100   85  90  95  95      C#

In [8]:
df.values

array([['채치수', '북산고', 197, 90, 85, 100, 95, 85, 'Python'],
       ['정대만', '북산고', 184, 40, 35, 50, 55, 25, 'Java'],
       ['송태섭', '북산고', 168, 80, 75, 70, 80, 75, 'Javascript'],
       ['서태웅', '북산고', 187, 40, 60, 70, 75, 80, nan],
       ['강백호', '북산고', 188, 15, 20, 10, 35, 10, nan],
       ['변덕규', '능남고', 202, 80, 100, 95, 85, 80, 'C'],
       ['황태산', '능남고', 188, 55, 65, 45, 40, 35, 'PYTHON'],
       ['윤대협', '능남고', 190, 100, 85, 90, 95, 95, 'C#']], dtype=object)

In [9]:
df.index # index 확인

Int64Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64', name='지원번호')

In [10]:
df.columns # colums 확인

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [11]:
df.shape # 총 몇개의 (row, col)인지

(8, 9)

## Series 확인

In [14]:
df['키'].describe() # 키 데이터에 대해서 총 몇개의 count ~ max가 있는지 보여줌

count      8.000000
mean     188.000000
std        9.985704
min      168.000000
25%      186.250000
50%      188.000000
75%      191.750000
max      202.000000
Name: 키, dtype: float64

In [17]:
df['키'].max() # 키 최댓값 min()이면 최솟값

202

In [18]:
df['키'].nlargest(3) # 키 큰 사람 순서대로 3명의 데이터

지원번호
6    202
1    197
8    190
Name: 키, dtype: int64

In [19]:
df['키'].mean() # 키의 평균값

188.0

In [20]:
df['키'].sum() # 키의 총 합

1504

In [22]:
df['SW특기'].count() # SW특기 데이터 중에서, NaN이 아닌 모든 데이터의 개수

6

In [24]:
df['학교'].unique() # 중복 제거하고, 존재하는 특별 값들만 출력

array(['북산고', '능남고'], dtype=object)

In [25]:
df['학교'].nunique() # .nunique() : unique한 값이 총 몇 개가 있는지 보여줌

2